# Interacting with Databases

In [12]:
import sqlite3
import pandas as pd

### Create a db using sqlite3 and read it in with pandas

In [8]:

conn = sqlite3.connect('data/employees.db')
c = conn.cursor()
c.execute("SELECT * FROM employees")
c.fetchall()

[(1, u'Max Eisenhart'), (2, u'Pietro Maximoff'), (3, u'Mortime Ton')]

In [9]:
pd.read_sql('select * from employees', conn)

   id             name
0   1    Max Eisenhart
1   2  Pietro Maximoff
2   3      Mortime Ton

In [10]:
db = _

In [11]:
# SELECT * FROM employees
#       WHERE id == '1'

db[db['id']==1]

   id           name
0   1  Max Eisenhart

### Create a db from python

In [32]:
query = """
CREATE TABLE test 
(a VARCHAR(20), b VARCHAR(20), 
c REAL, d INTEGER
);"""

In [33]:
conn = sqlite3.connect('data/test.db')
conn.execute(query)
conn.commit

In [43]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Sacramento' , 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [44]:
conn.executemany(stmt, data)
conn.commit

In [45]:
pd.read_sql('select * from test', conn)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Sacramento  California  1.70  5
2     Atlanta     Georgia  1.25  6
3  Sacramento  California  1.70  5
4     Atlanta     Georgia  1.25  6
5  Sacramento  California  1.70  5